analogdevicesinc/msdk/Libraries/Boards/MAX32570/Simulation/Include/test_regs.h
#define MXC_F_TEST_TM_SFBIST_POS                       (13) /**< TM_SFBIST Position */
#define MXC_F_TEST_TM_SFBIST                           ((uint32_t)(0x1 << MXC_F_TEST_TM_SFBIST_POS)) /**< TM_SFBIST Mask */

#define MXC_F_TEST_TM_POR_POS                          (14) /**< TM_POR Position */
#define MXC_F_TEST_TM_POR                              ((uint32_t)(0x1 << MXC_F_TEST_TM_POR_POS)) /**< TM_POR Mask */

#define MXC_F_TEST_TM_BOR_POS                          (15) /**< TM_BOR Position */
#define MXC_F_TEST_TM_BOR                              ((uint32_t)(0x1 << MXC_F_TEST_TM_BOR_POS)) /**< TM_BOR Mask */

#define MXC_F_TEST_TM_SCAN_MD_POS                      (16) /**< TM_SCAN_MD Position */
#define MXC_F_TEST_TM_SCAN_MD                          ((uint32_t)(0x7 << MXC_F_TEST_TM_SCAN_MD_POS)) /**< TM_SCAN_MD Mask */

#define MXC_F_TEST_TM_CKT_POS                          (20) /**< TM_CKT Position */
#define MXC_F_TEST_TM_CKT                              ((uint32_t)(0x1 << MXC_F_TEST_TM_CKT_POS)) /**< TM_CKT Mask */

#define MXC_F_TEST_TM_DOFF_POS                         (21) /**< TM_DOFF Position */
#define MXC_F_TEST_TM_DOFF                             ((uint32_t)(0x1 << MXC_F_TEST_TM_DOFF_POS)) /**< TM_DOFF Mask */

#define MXC_F_TEST_TM_DCW_POS                          (22) /**< TM_DCW Position */
#define MXC_F_TEST_TM_DCW                              ((uint32_t)(0x1 << MXC_F_TEST_TM_DCW_POS)) /**< TM_DCW Mask */

#define MXC_F_TEST_TM_SVM_BG_POS                       (24) /**< TM_SVM_BG Position */
#define MXC_F_TEST_TM_SVM_BG                           ((uint32_t)(0x1 << MXC_F_TEST_TM_SVM_BG_POS)) /**< TM_SVM_BG Mask */

#define MXC_F_TEST_TM_SVM_HV_POS                       (25) /**< TM_SVM_HV Position */
#define MXC_F_TEST_TM_SVM_HV                           ((uint32_t)(0x1 << MXC_F_TEST_TM_SVM_HV_POS)) /**< TM_SVM_HV Mask */

#define MXC_F_TEST_TM_PWCN_BOD_POS                     (26) /**< TM_PWCN_BOD Position */
#define MXC_F_TEST_TM_PWCN_BOD                         ((uint32_t)(0x1 << MXC_F_TEST_TM_PWCN_BOD_POS)) /**< TM_PWCN_BOD Mask */

#define MXC_F_TEST_TM_VMAIN_MON_PD_POS                 (27) /**< TM_VMAIN_MON_PD Position */
#define MXC_F_TEST_TM_VMAIN_MON_PD                     ((uint32_t)(0x1 << MXC_F_TEST_TM_VMAIN_MON_PD_POS)) /**< TM_VMAIN_MON_PD Mask */

#define MXC_F_TEST_TM_RETLDO_EN_POS                    (28) /**< TM_RETLDO_EN Position */
#define MXC_F_TEST_TM_RETLDO_EN                        ((uint32_t)(0x1 << MXC_F_TEST_TM_RETLDO_EN_POS)) /**< TM_RETLDO_EN Mask */

#define MXC_F_TEST_TM_NMI_DIS_POS                      (28) /**< TM_NMI_DIS Position */
#define MXC_F_TEST_TM_NMI_DIS                          ((uint32_t)(0x7FFFFFFF << MXC_F_TEST_TM_NMI_DIS_POS)) /**< TM_NMI_DIS Mask */

/**@} end of group TM_Register */

/**
 * @ingroup  test_registers
 * @defgroup TRCN_Register
 * @brief    Trim Control Register.
 * @{
 */
#define MXC_F_TEST_TRCN_CLKDIV_POS                     (0) /**< TRCN_CLKDIV Position */
#define MXC_F_TEST_TRCN_CLKDIV                         ((uint32_t)(0xFF << MXC_F_TEST_TRCN_CLKDIV_POS)) /**< TRCN_CLKDIV Mask */

/**@} end of group TRCN_Register */

/**
 * @ingroup  test_registers
 * @defgroup TCLK_Register
 * @brief    Test Clock Control Register.
 * @{
 */
#define MXC_F_TEST_TCLK_VCLKSRC_POS                    (0) /**< TCLK_VCLKSRC Position */
#define MXC_F_TEST_TCLK_VCLKSRC                        ((uint32_t)(0xFF << MXC_F_TEST_TCLK_VCLKSRC_POS)) /**< TCLK_VCLKSRC Mask */

#define MXC_F_TEST_TCLK_VCLKDIV_POS                    (8) /**< TCLK_VCLKDIV Position */
#define MXC_F_TEST_TCLK_VCLKDIV                        ((uint32_t)(0xF << MXC_F_TEST_TCLK_VCLKDIV_POS)) /**< TCLK_VCLKDIV Mask */

#define MXC_F_TEST_TCLK_VCLK_MODE_POS                  (12) /**< TCLK_VCLK_MODE Position */
#define MXC_F_TEST_TCLK_VCLK_MODE                      ((uint32_t)(0x1F << MXC_F_TEST_TCLK_VCLK_MODE_POS)) /**< TCLK_VCLK_MODE Mask */

/**@} end of group TCLK_Register */

/**
 * @ingroup  test_registers
 * @defgroup TMR0_Register
 * @brief    Security Test Mode Register.
 * @{
 */
#define MXC_F_TEST_TMR0_IDS_MODE0_POS                  (19) /**< TMR0_IDS_MODE0 Position */
#define MXC_F_TEST_TMR0_IDS_MODE0                      ((uint32_t)(0x1 << MXC_F_TEST_TMR0_IDS_MODE0_POS)) /**< TMR0_IDS_MODE0 Mask */

/**@} end of group TMR0_Register */

/**
 * @ingroup  test_registers
 * @defgroup TMR1_Register
 * @brief    Clock Test Mode Register.
 * @{
 */
#define MXC_F_TEST_TMR1_XTAL_TM1_POS                   (0) /**< TMR1_XTAL_TM1 Position */
#define MXC_F_TEST_TMR1_XTAL_TM1                       ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTAL_TM1_POS)) /**< TMR1_XTAL_TM1 Mask */

#define MXC_F_TEST_TMR1_XTAL_TM2_POS                   (1) /**< TMR1_XTAL_TM2 Position */
#define MXC_F_TEST_TMR1_XTAL_TM2                       ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTAL_TM2_POS)) /**< TMR1_XTAL_TM2 Mask */

#define MXC_F_TEST_TMR1_XTAL_PD_POS                    (2) /**< TMR1_XTAL_PD Position */
#define MXC_F_TEST_TMR1_XTAL_PD                        ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTAL_PD_POS)) /**< TMR1_XTAL_PD Mask */

#define MXC_F_TEST_TMR1_XTAL_BP_POS                    (3) /**< TMR1_XTAL_BP Position */
#define MXC_F_TEST_TMR1_XTAL_BP                        ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTAL_BP_POS)) /**< TMR1_XTAL_BP Mask */

#define MXC_F_TEST_TMR1_PLL0_IB_POS                    (4) /**< TMR1_PLL0_IB Position */
#define MXC_F_TEST_TMR1_PLL0_IB                        ((uint32_t)(0x1 << MXC_F_TEST_TMR1_PLL0_IB_POS)) /**< TMR1_PLL0_IB Mask */

#define MXC_F_TEST_TMR1_PLL0_VCO_POS                   (5) /**< TMR1_PLL0_VCO Position */
#define MXC_F_TEST_TMR1_PLL0_VCO                       ((uint32_t)(0x1 << MXC_F_TEST_TMR1_PLL0_VCO_POS)) /**< TMR1_PLL0_VCO Mask */

#define MXC_F_TEST_TMR1_PLL0_SEL_POS                   (6) /**< TMR1_PLL0_SEL Position */
#define MXC_F_TEST_TMR1_PLL0_SEL                       ((uint32_t)(0x1 << MXC_F_TEST_TMR1_PLL0_SEL_POS)) /**< TMR1_PLL0_SEL Mask */

#define MXC_F_TEST_TMR1_PLL0_CK_BYP_POS                (7) /**< TMR1_PLL0_CK_BYP Position */
#define MXC_F_TEST_TMR1_PLL0_CK_BYP                    ((uint32_t)(0x1 << MXC_F_TEST_TMR1_PLL0_CK_BYP_POS)) /**< TMR1_PLL0_CK_BYP Mask */

