analogdevicesinc/msdk/Libraries/Boards/MAX32570/Simulation/Include/test_regs.h
#define MXC_F_TEST_TMR1_HIRC_PD_POS                    (11) /**< TMR1_HIRC_PD Position */
#define MXC_F_TEST_TMR1_HIRC_PD                        ((uint32_t)(0x1 << MXC_F_TEST_TMR1_HIRC_PD_POS)) /**< TMR1_HIRC_PD Mask */

#define MXC_F_TEST_TMR1_96M_PD_POS                     (12) /**< TMR1_96M_PD Position */
#define MXC_F_TEST_TMR1_96M_PD                         ((uint32_t)(0x1 << MXC_F_TEST_TMR1_96M_PD_POS)) /**< TMR1_96M_PD Mask */

#define MXC_F_TEST_TMR1_8M_PD_POS                      (13) /**< TMR1_8M_PD Position */
#define MXC_F_TEST_TMR1_8M_PD                          ((uint32_t)(0x1 << MXC_F_TEST_TMR1_8M_PD_POS)) /**< TMR1_8M_PD Mask */

#define MXC_F_TEST_TMR1_8K_PD_POS                      (14) /**< TMR1_8K_PD Position */
#define MXC_F_TEST_TMR1_8K_PD                          ((uint32_t)(0x1 << MXC_F_TEST_TMR1_8K_PD_POS)) /**< TMR1_8K_PD Mask */

#define MXC_F_TEST_TMR1_6K_PD_POS                      (15) /**< TMR1_6K_PD Position */
#define MXC_F_TEST_TMR1_6K_PD                          ((uint32_t)(0x1 << MXC_F_TEST_TMR1_6K_PD_POS)) /**< TMR1_6K_PD Mask */

#define MXC_F_TEST_TMR1_X32D_POS                       (16) /**< TMR1_X32D Position */
#define MXC_F_TEST_TMR1_X32D                           ((uint32_t)(0x1 << MXC_F_TEST_TMR1_X32D_POS)) /**< TMR1_X32D Mask */

#define MXC_F_TEST_TMR1_32KBYP_POS                     (17) /**< TMR1_32KBYP Position */
#define MXC_F_TEST_TMR1_32KBYP                         ((uint32_t)(0x1 << MXC_F_TEST_TMR1_32KBYP_POS)) /**< TMR1_32KBYP Mask */

#define MXC_F_TEST_TMR1_RESV4_POS                      (19) /**< TMR1_RESV4 Position */
#define MXC_F_TEST_TMR1_RESV4                          ((uint32_t)(0x1 << MXC_F_TEST_TMR1_RESV4_POS)) /**< TMR1_RESV4 Mask */

/**@} end of group TMR1_Register */

/**
 * @ingroup  test_registers
 * @defgroup TMR2_Register
 * @brief    USB, HYPERBUS, I2C, and ADC Test Mode Register.
 * @{
 */
#define MXC_F_TEST_TMR2_USB_TM0_POS                    (0) /**< TMR2_USB_TM0 Position */
#define MXC_F_TEST_TMR2_USB_TM0                        ((uint32_t)(0x1 << MXC_F_TEST_TMR2_USB_TM0_POS)) /**< TMR2_USB_TM0 Mask */

#define MXC_F_TEST_TMR2_USB_TM1_POS                    (1) /**< TMR2_USB_TM1 Position */
#define MXC_F_TEST_TMR2_USB_TM1                        ((uint32_t)(0x1 << MXC_F_TEST_TMR2_USB_TM1_POS)) /**< TMR2_USB_TM1 Mask */

#define MXC_F_TEST_TMR2_RESV0_POS                      (2) /**< TMR2_RESV0 Position */
#define MXC_F_TEST_TMR2_RESV0                          ((uint32_t)(0x1 << MXC_F_TEST_TMR2_RESV0_POS)) /**< TMR2_RESV0 Mask */

#define MXC_F_TEST_TMR2_USB_TMEN_POS                   (3) /**< TMR2_USB_TMEN Position */
#define MXC_F_TEST_TMR2_USB_TMEN                       ((uint32_t)(0x1 << MXC_F_TEST_TMR2_USB_TMEN_POS)) /**< TMR2_USB_TMEN Mask */

#define MXC_F_TEST_TMR2_USB_XTEST_POS                  (4) /**< TMR2_USB_XTEST Position */
#define MXC_F_TEST_TMR2_USB_XTEST                      ((uint32_t)(0x1 << MXC_F_TEST_TMR2_USB_XTEST_POS)) /**< TMR2_USB_XTEST Mask */

#define MXC_F_TEST_TMR2_USB_VBUSDET_POS                (5) /**< TMR2_USB_VBUSDET Position */
#define MXC_F_TEST_TMR2_USB_VBUSDET                    ((uint32_t)(0x1 << MXC_F_TEST_TMR2_USB_VBUSDET_POS)) /**< TMR2_USB_VBUSDET Mask */

#define MXC_F_TEST_TMR2_IRRX_SDA0_POS                  (8) /**< TMR2_IRRX_SDA0 Position */
#define MXC_F_TEST_TMR2_IRRX_SDA0                      ((uint32_t)(0x1 << MXC_F_TEST_TMR2_IRRX_SDA0_POS)) /**< TMR2_IRRX_SDA0 Mask */

#define MXC_F_TEST_TMR2_IRRX_SCL0_POS                  (9) /**< TMR2_IRRX_SCL0 Position */
#define MXC_F_TEST_TMR2_IRRX_SCL0                      ((uint32_t)(0x1 << MXC_F_TEST_TMR2_IRRX_SCL0_POS)) /**< TMR2_IRRX_SCL0 Mask */

#define MXC_F_TEST_TMR2_IRRX_SDA1_POS                  (10) /**< TMR2_IRRX_SDA1 Position */
#define MXC_F_TEST_TMR2_IRRX_SDA1                      ((uint32_t)(0x1 << MXC_F_TEST_TMR2_IRRX_SDA1_POS)) /**< TMR2_IRRX_SDA1 Mask */

#define MXC_F_TEST_TMR2_IRRX_SCL1_POS                  (11) /**< TMR2_IRRX_SCL1 Position */
#define MXC_F_TEST_TMR2_IRRX_SCL1                      ((uint32_t)(0x1 << MXC_F_TEST_TMR2_IRRX_SCL1_POS)) /**< TMR2_IRRX_SCL1 Mask */

#define MXC_F_TEST_TMR2_SDA0_DGEN_POS                  (12) /**< TMR2_SDA0_DGEN Position */
#define MXC_F_TEST_TMR2_SDA0_DGEN                      ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SDA0_DGEN_POS)) /**< TMR2_SDA0_DGEN Mask */

#define MXC_F_TEST_TMR2_SCL0_DGEN_POS                  (13) /**< TMR2_SCL0_DGEN Position */
#define MXC_F_TEST_TMR2_SCL0_DGEN                      ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SCL0_DGEN_POS)) /**< TMR2_SCL0_DGEN Mask */

#define MXC_F_TEST_TMR2_SDA1_DGEN_POS                  (14) /**< TMR2_SDA1_DGEN Position */
#define MXC_F_TEST_TMR2_SDA1_DGEN                      ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SDA1_DGEN_POS)) /**< TMR2_SDA1_DGEN Mask */

#define MXC_F_TEST_TMR2_SCL1_DGEN_POS                  (15) /**< TMR2_SCL1_DGEN Position */
#define MXC_F_TEST_TMR2_SCL1_DGEN                      ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SCL1_DGEN_POS)) /**< TMR2_SCL1_DGEN Mask */

#define MXC_F_TEST_TMR2_SDA0_DGBYP_POS                 (16) /**< TMR2_SDA0_DGBYP Position */
#define MXC_F_TEST_TMR2_SDA0_DGBYP                     ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SDA0_DGBYP_POS)) /**< TMR2_SDA0_DGBYP Mask */

#define MXC_F_TEST_TMR2_SCL0_DGBYP_POS                 (17) /**< TMR2_SCL0_DGBYP Position */
#define MXC_F_TEST_TMR2_SCL0_DGBYP                     ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SCL0_DGBYP_POS)) /**< TMR2_SCL0_DGBYP Mask */

#define MXC_F_TEST_TMR2_SDA1_DGBYP_POS                 (18) /**< TMR2_SDA1_DGBYP Position */
#define MXC_F_TEST_TMR2_SDA1_DGBYP                     ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SDA1_DGBYP_POS)) /**< TMR2_SDA1_DGBYP Mask */

#define MXC_F_TEST_TMR2_SCL1_DGBYP_POS                 (19) /**< TMR2_SCL1_DGBYP Position */
#define MXC_F_TEST_TMR2_SCL1_DGBYP                     ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SCL1_DGBYP_POS)) /**< TMR2_SCL1_DGBYP Mask */

#define MXC_F_TEST_TMR2_ADCOUT_POS                     (20) /**< TMR2_ADCOUT Position */
#define MXC_F_TEST_TMR2_ADCOUT                         ((uint32_t)(0x1 << MXC_F_TEST_TMR2_ADCOUT_POS)) /**< TMR2_ADCOUT Mask */

#define MXC_F_TEST_TMR2_RDS_BYP_POS                    (24) /**< TMR2_RDS_BYP Position */
#define MXC_F_TEST_TMR2_RDS_BYP                        ((uint32_t)(0x1 << MXC_F_TEST_TMR2_RDS_BYP_POS)) /**< TMR2_RDS_BYP Mask */

#define MXC_F_TEST_TMR2_HYP_CKEN_POS                   (25) /**< TMR2_HYP_CKEN Position */
#define MXC_F_TEST_TMR2_HYP_CKEN                       ((uint32_t)(0x1 << MXC_F_TEST_TMR2_HYP_CKEN_POS)) /**< TMR2_HYP_CKEN Mask */

/**@} end of group TMR2_Register */

/**
 * @ingroup  test_registers
 * @defgroup TMR3_Register
 * @brief    Memory Test Mode Register.
 * @{
 */
#define MXC_F_TEST_TMR3_ROM_TEST1_POS                  (0) /**< TMR3_ROM_TEST1 Position */
#define MXC_F_TEST_TMR3_ROM_TEST1                      ((uint32_t)(0x1 << MXC_F_TEST_TMR3_ROM_TEST1_POS)) /**< TMR3_ROM_TEST1 Mask */

#define MXC_F_TEST_TMR3_SRAM_TEST1_POS                 (1) /**< TMR3_SRAM_TEST1 Position */
#define MXC_F_TEST_TMR3_SRAM_TEST1                     ((uint32_t)(0x1 << MXC_F_TEST_TMR3_SRAM_TEST1_POS)) /**< TMR3_SRAM_TEST1 Mask */

/**@} end of group TMR3_Register */

/**
 * @ingroup  test_registers
 * @defgroup MBCN_Register
 * @brief    Memory BIST Control Register.
 * @{
 */
#define MXC_F_TEST_MBCN_SYSRAM1_POS                    (0) /**< MBCN_SYSRAM1 Position */
#define MXC_F_TEST_MBCN_SYSRAM1                        ((uint32_t)(0x1 << MXC_F_TEST_MBCN_SYSRAM1_POS)) /**< MBCN_SYSRAM1 Mask */

#define MXC_F_TEST_MBCN_SYSRAM2_POS                    (1) /**< MBCN_SYSRAM2 Position */
#define MXC_F_TEST_MBCN_SYSRAM2                        ((uint32_t)(0x1 << MXC_F_TEST_MBCN_SYSRAM2_POS)) /**< MBCN_SYSRAM2 Mask */

